//Задача. Дано масив ідентифікаційних кодів користувачів, які заходили на сайт протягом дня.
// Розробити функцію, яка б з"ясовувала, чи є у даному масиві вказаний ідентифікаційний номер
//var a=prompt("ID ==","");


  
/*
var id = ["00","05","03","00","05","03","07","00","10"];
var x = prompt("Enter ID =","99")
b = false;
for (var i =0;i<id.length;i++){
        if (id[i]==x){
            b=true;
    }
 }
document.write(b);
*/





//Задача. Розробити функцію, яка серед заданої послідовності символів (у функцію
//можна передати довільну кількість символів) виводить тільки голосні 
 
 /*
    function GetAOU(){
    let row = prompt("Enter Numbers","");
    let arr1 = row.split(' ');
     //var text =["a","b","s","d","a","f","d","s","a","y","u"];
     var hol =[];
        for(var i=0;i<arr1.length;i++){
            if(
            arr1[i]=="a"||arr1[i]=="e"||arr1[i]=="i"||arr1[i]=="o"||arr1[i]=="u"||arr1[i]=="y"
            )
        
            hol.push(arr1[i]);
        }
        document.write(hol);
    }
    GetAOU();
    */


//Задача. Дано масив вакансій. Вивести на екран скільки разів зустрічається кожна вакансія
//Приклад: масив вакансіій ["HR","програміст","HR","тестувальник","HR","програміст"]
//Потрібно вивести: HR - 1,  програміст -2, тестувальник - 1.



/* var arr = ["HR","програміст","HR","тестувальник","HR","HR","програміст","HR","тестувальник","HR","програміст", "HR","програміст","HR","тестувальник","HR","програміст"]
let hr=0;Pr=0;qa=0;
for(var i =0;i<=arr.length;i++){
    if(arr[i]=="HR"){
        hr=hr+1
    }
    else if(arr[i]=="програміст"){
        Pr=Pr+1
    }
    else if(arr[i]=="тестувальник"){
        qa=qa+1
    }
    
}
document.write("ГР ="+hr)
document.write("Програмістів ="+Pr)
document.write("тестувальник ="+qa) }
*/